NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/bootloader.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

  4. This software must only be used in a processor manufactured by Nordic
  Semiconductor ASA, or in a processor manufactured by a third party that
  is used in combination with a processor manufactured by Nordic Semiconductor.


THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include "dfu_types.h"
#include "nrf_flash.h"
#include "timeslot_handler.h"
#include "version_handler.h"
#include "rbc_mesh.h"
#include "event_handler.h"
#include "transport_control.h"

#include "nrf_sdm.h"
#include "nrf51.h"
#include "bootloader_util.h"
#include "boards.h"
#include <string.h>
#include <stdbool.h>

#define FULL_ADDRESS(short_addr) (((uint32_t) (short_addr)) << 8);

#define MAX_NUMBER_INTERRUPTS   (32)
#define HANDLE_COUNT            (20)
/*****************************************************************************
* Static globals
*****************************************************************************/
static dfu_bootloader_info_t g_bl_info;
struct 
{
    uint16_t length;
    uint8_t data[28];
} g_srv_data[HANDLE_COUNT];

typedef struct
{
    uint16_t short_addr;
    uint8_t data[16];
} dfu_record_t;
/******************************************************************************
* Static Functions
*****************************************************************************/
static void get_bootloader_info(dfu_bootloader_info_t* p_info)
{
    memcpy(p_info, 
            (dfu_bootloader_info_t*) BOOTLOADER_INFO_ADDRESS, 
            sizeof(dfu_bootloader_info_t));
}

#if 0
static uint16_t crc16_compute(const uint8_t * p_data, uint32_t size, const uint16_t * p_crc)
{
    uint32_t i;
    uint16_t crc = (p_crc == NULL) ? 0xffff : *p_crc;

    for (i = 0; i < size; i++)
    {
        crc  = (unsigned char)(crc >> 8) | (crc << 8);
        crc ^= p_data[i];
        crc ^= (unsigned char)(crc & 0xff) >> 4;
        crc ^= (crc << 8) << 4;
        crc ^= ((crc & 0xff) << 4) << 1;
    }

    return crc;
}
static bool bank_is_valid(const uint8_t* bank_start, uint32_t size, uint16_t bank_crc)
{
    uint16_t crc = crc16_compute(bank_start, size, NULL);
    return (crc == bank_crc);
}
/* generic application restart. Never returns */
static void exit_bootloader(void)
{   
    sd_softdevice_vector_table_base_set(APP_START_ADDRESS);
    
    bootloader_util_app_start(APP_START_ADDRESS);
}
#endif

static void init_leds(void)
{
    nrf_gpio_range_cfg_output(0, 32);
    NRF_GPIO->OUTCLR = 0xFFFFFFFF;
}

/*****************************************************************************
* Dummy Functions
*****************************************************************************/
void SVC_Handler(void)
{
    __BKPT(0);
}

void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    __BKPT(0);
}

void rbc_mesh_event_handler(rbc_mesh_event_t* p_evt)
{
    if (p_evt->event_type == RBC_MESH_EVENT_TYPE_NEW_VAL ||
        p_evt->event_type == RBC_MESH_EVENT_TYPE_UPDATE_VAL)
    {
        if (p_evt->data_len >= 8)
        {
            uint16_t address;
            memcpy(&address, &p_evt->data[0], 2);
            uint8_t* data = &p_evt->data[2];
            
            
        }            
    }
}

uint32_t mesh_srv_char_val_set(uint8_t handle, uint8_t* data, uint16_t length)
{
    if (handle > HANDLE_COUNT || handle == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    g_srv_data[handle].length = length;
    memcpy(g_srv_data[handle].data, data, length);
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_val_get(uint8_t handle, uint8_t* data, uint16_t* length)
{
    if (handle > HANDLE_COUNT || handle == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    *length = g_srv_data[handle].length;
    memcpy(data, g_srv_data[handle].data, g_srv_data[handle].length);
    return NRF_SUCCESS;
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/
int main(void)
{
    init_leds();
    extern uint32_t __initial_sp;
    volatile uint32_t* free_mem = (uint32_t*) (&__initial_sp);
    volatile uint32_t last_addr = 0x20000000 + NRF_FICR->SIZERAMBLOCKS * NRF_FICR->NUMRAMBLOCK;
    volatile uint32_t available = last_addr - ((uint32_t) free_mem);
    
    get_bootloader_info(&g_bl_info);
    nrf_flash_erase((uint32_t*) BOOTLOADER_INFO_ADDRESS, 0x400);
    uint8_t data1[] = {0xAA, 0xAA, 0xAA, 0xAA};
    uint8_t data2[] = {0xFF, 0xFF, 0x00, 0x0F};
    
    nrf_flash_store((uint32_t*) BOOTLOADER_INFO_ADDRESS, (uint8_t*) &data1, 4, 0);
    nrf_flash_store((uint32_t*) BOOTLOADER_INFO_ADDRESS, (uint8_t*) &data2, 4, 0);
    
    tc_init(0xA541A68F, 38);
    event_handler_init();
    vh_init(HANDLE_COUNT, 100000);
    timeslot_handler_init();
    for (uint32_t i = 0; i < HANDLE_COUNT; ++i)
    {
        uint8_t data[] = {'l', 'o', 'l'};
        mesh_srv_char_val_set(i + 1, data, 3);
        vh_value_enable(i + 1);
    }
    
#if 0
    if (g_bl_info.using_crc && !bank_is_valid((uint8_t*) g_bl_info.bank_addr, g_bl_info.size, g_bl_info.image_crc))
    {
        NRF_GPIO->OUTCLR = (1 << LED_START);
        exit_bootloader();
    }
    
    /* do the flash */
    nrf_flash_erase((uint32_t*) g_bl_info.start_addr, g_bl_info.size);
    nrf_flash_store((uint32_t*) g_bl_info.start_addr, (uint8_t*) g_bl_info.bank_addr, g_bl_info.size, 0);
    
    NRF_GPIO->OUTCLR = (1 << LED_START);
    exit_bootloader();
#endif    
    
    while (1)
    {
        __WFE();
    }
}
